{
  "basics": {
    "name": "Jason Wu",
    "email": "wuj400646@gmail.com",
    "phone": "",
    "website": "https://jasonwuuuuuu.github.io",
    "summary": "The blogger graduated with a master's degree in Electronic Information from Xijing University. His research areas include deep learning, diffusion models, object detection, and sequence to sequence prediction tasks. Currently, his research focuses on transportation and intelligent driving. The broadcast published 2 SCI papers and 1 EI conference paper between 2024-2025, and applied for 1 software copyright.",
    "location": {
      "address": "Chongqing Jiaotong University (Jiangjin Campus)",
      "postalCode": "",
      "city": "Chongqing",
      "countryCode": "China",
      "region": "jiangjing"
    },
    "profiles": [
      {
        "network": "Google Scholar",
        "username": "",
        "url": "https://scholar.google.com/citations?user=PS_CX0AAAAAJ"
      },
      {
        "network": "ORCID",
        "username": "Haiyang Wu",
        "url": "https://orcid.org/my-orcid?orcid=0009-0009-2122-7435"
      },
      {
        "network": "GitHub",
        "username": "JasonWuuuuuu",
        "url": "https://github.com/JasonWuuuuuu"
      }
    ]
  },
  "work": [],
  "education": [
    {
      "institution": "Chongiqng jiaotong  University",
      "area": "Ph.D in traffic transportation engineering",
      "studyType": "full-time",
      "startDate": "2025.9.1",
      "endDate": "2030--",
      "gpa": null,
      "courses": []
    },
    {
      "institution": "Xijing University",
      "area": "M.S. in electronic information",
      "studyType": "full-time",
      "startDate": "2022.8.15",
      "endDate": "2025.1.6",
      "gpa": null,
      "courses": []
    },
    {
      "institution": "Chongqing College of Mobile Communication",
      "area": "B.S. in electronic engineering and automation",
      "studyType": "full-time",
      "startDate": "2018.9.1",
      "endDate": "2022.7.1",
      "gpa": null,
      "courses": []
    }
  ],
  "skills": [],
  "languages": [],
  "interests": [],
  "references": [],
  "publications": [
    {
      "name": "Crack Detection on Road Surfaces Based on Improved YOLOv8",
      "publisher": "IEEE Access",
      "releaseDate": "2024-12-16",
      "website": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10802889",
      "summary": "Road defect detection is vital for road maintenance but remains challenging due to the complexity of backgrounds, low resolution, and crack similarity. This paper introduces YOLOv8-VOS(VOS means ‘vanillaNet+ODConv+SEAttention’), an enhanced road crack detection algorithm that incorporates an improved Vanilla Net backbone with Squeeze-and-Excitation (SE) attention and ODConv modules. The loss function is replaced with WIoU to better balance bounding box regression. Experiments on the RDD2022 dataset demonstrate a 2% improvement in average accuracy over the original YOLOv8, achieving 53.7%. The proposed model effectively identifies road cracks in complex traffic backgrounds, contributing to safer and more efficient road maintenance."
    },
    {
      "name": "Open-set image segmentation based on an improved Segment Anything model",
      "publisher": "2024 6th International Conference on Robotics, Intelligent Control and Artificial Intelligence (RICAI)",
      "releaseDate": "2025-03-13",
      "website": "10.1109/RICAI64321.2024.10911698",
      "summary": "Image segmentation is crucial in computer vision, but traditional approaches are limited by dataset and label diversity. Segment Anything introduces open-set segmentation capabilities but struggles with clause-level prompts and precise mask edges. This paper presents SAM-TP, a new algorithm combining Grounding DINO for clause-level prompt handling and Segment Anything for segmentation. By integrating non-maximum suppression and connected component denoising, we refine segmentation accuracy. Additionally, incorporating ViT-Matte enhances edge precision through a trimap-based structure. Experiments on the COCO2017 dataset show that SAM-TP improves Mean Pixel Accuracy by 6.04%, achieving 24.74%, demonstrating its enhanced foreground-background segmentation ability."
    },
    {
      "name": "Remote Sensing Image Super-Resolution Reconstruction by Fusing Multi-Scale Receptive Fields and Hybrid Transformer",
      "publisher": "Scientific Reports",
      "releaseDate": "2025-01-16",
      "website": "https://www.nature.com/articles/s41598-025-86446-5",
      "summary": "To enhance high-frequency perceptual information and texture details in remote sensing images and address the challenges of super-resolution reconstruction algorithms during training, particularly the issue of missing details, this paper proposes an improved remote sensing image super-resolution reconstruction model. The generator network of the model employs multi-scale convolutional kernels to extract image features and utilizes a multi-head self-attention mechanism to dynamically fuse these features, significantly improving the ability to capture both fine details and global information in remote sensing images. Additionally, the model introduces a multi-stage Hybrid Transformer structure, which processes features at different resolutions progressively, from low resolution to high resolution, substantially enhancing reconstruction quality and detail recovery. The discriminator combines multi-scale convolution, global Transformer, and hierarchical feature discriminators, providing a comprehensive and refined evaluation of image quality. Finally, the model incorporates a Charbonnier loss function and total variation (TV) loss function, which significantly improve training stability and accelerate convergence. Experimental results demonstrate that the proposed method, compared to the SRGAN algorithm, achieves average improvements of approximately 3.61 dB in Peak Signal-to-Noise Ratio (PSNR), 0.070 (8.2%) in Structural Similarity Index (SSIM), and 0.030 (3.1%) in Feature Similarity Index (FSIM) across multiple datasets, showing significant performance gains."
    }
  ],
  "presentations": [
    {
      "name": "Talk 1 on Relevant Topic in Your Field",
      "event": "UC San Francisco, Department of Testing",
      "date": "2012-03-01",
      "location": "San Francisco, CA, USA",
      "description": ""
    },
    {
      "name": "Tutorial 1 on Relevant Topic in Your Field",
      "event": "UC-Berkeley Institute for Testing Science",
      "date": "2013-03-01",
      "location": "Berkeley, CA, USA",
      "description": ""
    },
    {
      "name": "Talk 2 on Relevant Topic in Your Field",
      "event": "London School of Testing",
      "date": "2014-02-01",
      "location": "London, UK",
      "description": ""
    },
    {
      "name": "Conference Proceeding talk 3 on Relevant Topic in Your Field",
      "event": "Testing Institute of America 2014 Annual Conference",
      "date": "2014-03-01",
      "location": "Los Angeles, CA, USA",
      "description": ""
    }
  ],
  "teaching": [
    {
      "course": "Teaching experience 1",
      "institution": "University 1, Department",
      "date": "2014-01-01",
      "role": "Undergraduate course",
      "description": ""
    },
    {
      "course": "Teaching experience 2",
      "institution": "University 1, Department",
      "date": "2015-01-01",
      "role": "Workshop",
      "description": ""
    }
  ],
  "portfolio": [
    {
      "name": "Portfolio item number 1",
      "category": "portfolio",
      "date": "",
      "url": "",
      "description": "Short description of portfolio item number 1<br/><img src='/images/500x300.png'>"
    }
  ]
}